letssave/internship/LIS3DH/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M4F */


void BOARD_InitPins(void)
{
    /* Enables the clock for the IOCON block. 0 = Disable; 1 = Enable.: 0x01u */
    CLOCK_EnableClock(kCLOCK_Iocon);
    CLOCK_EnableClock(kCLOCK_InputMux);
    CLOCK_EnableClock(kCLOCK_Gpio0);
    CLOCK_EnableClock(kCLOCK_Gpio1);
    CLOCK_EnableClock(kCLOCK_Gpio2);
    CLOCK_EnableClock(kCLOCK_Gpio3);
    CLOCK_EnableClock(kCLOCK_Gpio4);
    CLOCK_EnableClock(kCLOCK_Gpio5);
/************************* SDRAM **************************/

    const uint32_t port0_pin15_config = (/* Pin is configured as EMC_WEN */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN15 (coords: L4) is configured as EMC_WEN */
        IOCON_PinMuxSet(IOCON, 0U, 15U, port0_pin15_config);

        const uint32_t port0_pin18_config = (/* Pin is configured as EMC_A(0) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN18 (coords: C14) is configured as EMC_A(0) */
        IOCON_PinMuxSet(IOCON, 0U, 18U, port0_pin18_config);

        const uint32_t port0_pin19_config = (/* Pin is configured as EMC_A(1) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN19 (coords: C6) is configured as EMC_A(1) */
        IOCON_PinMuxSet(IOCON, 0U, 19U, port0_pin19_config);

        const uint32_t port0_pin2_config = (/* Pin is configured as EMC_D(0) */
                                            IOCON_PIO_FUNC6 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Input filter disabled */
                                            IOCON_PIO_INPFILT_OFF |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN2 (coords: E9) is configured as EMC_D(0) */
        IOCON_PinMuxSet(IOCON, 0U, 2U, port0_pin2_config);

        const uint32_t port0_pin20_config = (/* Pin is configured as EMC_A(2) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN20 (coords: D13) is configured as EMC_A(2) */
        IOCON_PinMuxSet(IOCON, 0U, 20U, port0_pin20_config);

        const uint32_t port0_pin21_config = (/* Pin is configured as EMC_A(3) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN21 (coords: C13) is configured as EMC_A(3) */
        IOCON_PinMuxSet(IOCON, 0U, 21U, port0_pin21_config);


        const uint32_t port0_pin3_config = (/* Pin is configured as EMC_D(1) */
                                            IOCON_PIO_FUNC6 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Input filter disabled */
                                            IOCON_PIO_INPFILT_OFF |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN3 (coords: A10) is configured as EMC_D(1) */
        IOCON_PinMuxSet(IOCON, 0U, 3U, port0_pin3_config);

        const uint32_t port0_pin4_config = (/* Pin is configured as EMC_D(2) */
                                            IOCON_PIO_FUNC6 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Input filter disabled */
                                            IOCON_PIO_INPFILT_OFF |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN4 (coords: C8) is configured as EMC_D(2) */
        IOCON_PinMuxSet(IOCON, 0U, 4U, port0_pin4_config);

