letssave/internship/LIS3DH/pin_mux.c
        const uint32_t port0_pin5_config = (/* Pin is configured as EMC_D(3) */
                                            IOCON_PIO_FUNC6 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Input filter disabled */
                                            IOCON_PIO_INPFILT_OFF |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN5 (coords: E7) is configured as EMC_D(3) */
        IOCON_PinMuxSet(IOCON, 0U, 5U, port0_pin5_config);

        const uint32_t port0_pin6_config = (/* Pin is configured as EMC_D(4) */
                                            IOCON_PIO_FUNC6 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Input filter disabled */
                                            IOCON_PIO_INPFILT_OFF |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN6 (coords: A5) is configured as EMC_D(4) */
        IOCON_PinMuxSet(IOCON, 0U, 6U, port0_pin6_config);

        const uint32_t port0_pin7_config = (/* Pin is configured as EMC_D(5) */
                                            IOCON_PIO_FUNC6 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Input filter disabled */
                                            IOCON_PIO_INPFILT_OFF |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN7 (coords: H12) is configured as EMC_D(5) */
        IOCON_PinMuxSet(IOCON, 0U, 7U, port0_pin7_config);

        const uint32_t port0_pin8_config = (/* Pin is configured as EMC_D(6) */
                                            IOCON_PIO_FUNC6 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Input filter disabled */
                                            IOCON_PIO_INPFILT_OFF |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN8 (coords: H10) is configured as EMC_D(6) */
        IOCON_PinMuxSet(IOCON, 0U, 8U, port0_pin8_config);

        const uint32_t port0_pin9_config = (/* Pin is configured as EMC_D(7) */
                                            IOCON_PIO_FUNC6 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Input filter disabled */
                                            IOCON_PIO_INPFILT_OFF |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN9 (coords: G12) is configured as EMC_D(7) */
        IOCON_PinMuxSet(IOCON, 0U, 9U, port0_pin9_config);

        const uint32_t port1_pin10_config = (/* Pin is configured as EMC_RASN */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN10 (coords: N9) is configured as EMC_RASN */
        IOCON_PinMuxSet(IOCON, 1U, 10U, port1_pin10_config);

        const uint32_t port1_pin11_config = (/* Pin is configured as EMC_CLK(0) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN11 (coords: B4) is configured as EMC_CLK(0) */
        IOCON_PinMuxSet(IOCON, 1U, 11U, port1_pin11_config);

        const uint32_t port1_pin12_config = (/* Pin is configured as EMC_DYCSN(0) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN12 (coords: K9) is configured as EMC_DYCSN(0) */
        IOCON_PinMuxSet(IOCON, 1U, 12U, port1_pin12_config);

