letssave/internship/LIS3DH/pin_mux.c
        const uint32_t port1_pin13_config = (/* Pin is configured as EMC_DQM(0) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN13 (coords: G10) is configured as EMC_DQM(0) */
        IOCON_PinMuxSet(IOCON, 1U, 13U, port1_pin13_config);

        const uint32_t port1_pin14_config = (/* Pin is configured as EMC_DQM(1) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN14 (coords: C12) is configured as EMC_DQM(1) */
        IOCON_PinMuxSet(IOCON, 1U, 14U, port1_pin14_config);

        const uint32_t port1_pin15_config = (/* Pin is configured as EMC_CKE(0) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN15 (coords: A11) is configured as EMC_CKE(0) */
        IOCON_PinMuxSet(IOCON, 1U, 15U, port1_pin15_config);

        const uint32_t port1_pin16_config = (/* Pin is configured as EMC_A(10) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN16 (coords: B7) is configured as EMC_A(10) */
        IOCON_PinMuxSet(IOCON, 1U, 16U, port1_pin16_config);

        const uint32_t port1_pin19_config = (/* Pin is configured as EMC_D(8) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN19 (coords: L1) is configured as EMC_D(8) */
        IOCON_PinMuxSet(IOCON, 1U, 19U, port1_pin19_config);

        const uint32_t port1_pin20_config = (/* Pin is configured as EMC_D(9) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN20 (coords: M1) is configured as EMC_D(9) */
        IOCON_PinMuxSet(IOCON, 1U, 20U, port1_pin20_config);

        const uint32_t port1_pin21_config = (/* Pin is configured as EMC_D(10) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN21 (coords: N8) is configured as EMC_D(10) */
        IOCON_PinMuxSet(IOCON, 1U, 21U, port1_pin21_config);

        const uint32_t port1_pin23_config = (/* Pin is configured as EMC_A(11) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN23 (coords: M10) is configured as EMC_A(11) */
        IOCON_PinMuxSet(IOCON, 1U, 23U, port1_pin23_config);

        const uint32_t port1_pin24_config = (/* Pin is configured as EMC_A(12) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN24 (coords: N14) is configured as EMC_A(12) */
        IOCON_PinMuxSet(IOCON, 1U, 24U, port1_pin24_config);

        const uint32_t port1_pin25_config = (/* Pin is configured as EMC_A(13) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN25 (coords: M12) is configured as EMC_A(13) */
        IOCON_PinMuxSet(IOCON, 1U, 25U, port1_pin25_config);

        const uint32_t port1_pin26_config = (/* Pin is configured as EMC_A(8) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN26 (coords: J10) is configured as EMC_A(8) */
        IOCON_PinMuxSet(IOCON, 1U, 26U, port1_pin26_config);

