letssave/internship/LIS3DH/pin_mux.c
        const uint32_t port1_pin27_config = (/* Pin is configured as EMC_A(9) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN27 (coords: F10) is configured as EMC_A(9) */
        IOCON_PinMuxSet(IOCON, 1U, 27U, port1_pin27_config);

        const uint32_t port1_pin28_config = (/* Pin is configured as EMC_D(12) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN28 (coords: E12) is configured as EMC_D(12) */
        IOCON_PinMuxSet(IOCON, 1U, 28U, port1_pin28_config);

        const uint32_t port1_pin29_config = (/* Pin is configured as EMC_D(13) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN29 (coords: C11) is configured as EMC_D(13) */
        IOCON_PinMuxSet(IOCON, 1U, 29U, port1_pin29_config);

        const uint32_t port1_pin30_config = (/* Pin is configured as EMC_D(14) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN30 (coords: A8) is configured as EMC_D(14) */
        IOCON_PinMuxSet(IOCON, 1U, 30U, port1_pin30_config);

        const uint32_t port1_pin31_config = (/* Pin is configured as EMC_D(15) */
                                             IOCON_PIO_FUNC6 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Fast mode, slew rate control is disabled */
                                             IOCON_PIO_SLEW_FAST |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN31 (coords: C5) is configured as EMC_D(15) */
        IOCON_PinMuxSet(IOCON, 1U, 31U, port1_pin31_config);

        const uint32_t port1_pin4_config = (/* Pin is configured as EMC_D(11) */
                                            IOCON_PIO_FUNC6 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Input filter disabled */
                                            IOCON_PIO_INPFILT_OFF |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN4 (coords: D4) is configured as EMC_D(11) */
        IOCON_PinMuxSet(IOCON, 1U, 4U, port1_pin4_config);

        const uint32_t port1_pin5_config = (/* Pin is configured as EMC_A(4) */
                                            IOCON_PIO_FUNC6 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Input filter disabled */
                                            IOCON_PIO_INPFILT_OFF |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN5 (coords: E4) is configured as EMC_A(4) */
        IOCON_PinMuxSet(IOCON, 1U, 5U, port1_pin5_config);

        const uint32_t port1_pin6_config = (/* Pin is configured as EMC_A(5) */
                                            IOCON_PIO_FUNC6 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Input filter disabled */
                                            IOCON_PIO_INPFILT_OFF |
                                            /* Fast mode, slew rate control is disabled */
                                            IOCON_PIO_SLEW_FAST |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN6 (coords: G4) is configured as EMC_A(5) */
        IOCON_PinMuxSet(IOCON, 1U, 6U, port1_pin6_config);

