letssave/internship/LIS3DH/pin_mux.c
    const uint32_t port3_pin27_config = (/* Pin is configured as FC9_SCK */
                                         IOCON_PIO_FUNC1 |
                                         /* Selects pull-up function */
                                         IOCON_PIO_MODE_PULLUP |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Input filter disabled */
                                         IOCON_PIO_INPFILT_OFF |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN20 (coords: N2) is configured as FC9_SCK */
    IOCON_PinMuxSet(IOCON, 3U, 27U, port3_pin27_config);

//#ifdef SD___
    /************* SD CARD **********************/
      const uint32_t port2_pin10_config = (
        IOCON_PIO_FUNC2 |                                        /* Pin is configured as SD_CARD_DET_N */
        IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
        IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
        IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
        IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
        IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
        IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
      );
      IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN10_IDX, port2_pin10_config); /* PORT2 PIN10 (coords: P1) is configured as SD_CARD_DET_N */
      const uint32_t port2_pin3_config = (
        IOCON_PIO_FUNC2 |                                        /* Pin is configured as SD_CLK */
        IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
        IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
        IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
        IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
        IOCON_PIO_SLEW_FAST |                                    /* Fast mode, slew rate control is disabled */
        IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
      );
      IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN3_IDX, port2_pin3_config); /* PORT2 PIN3 (coords: B1) is configured as SD_CLK */
      const uint32_t port2_pin4_config = (
        IOCON_PIO_FUNC2 |                                        /* Pin is configured as SD_CMD */
        IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
        IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
        IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
        IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
        IOCON_PIO_SLEW_FAST |                                    /* Fast mode, slew rate control is disabled */
        IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
      );
      IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN4_IDX, port2_pin4_config); /* PORT2 PIN4 (coords: D3) is configured as SD_CMD */
      const uint32_t port2_pin5_config = (
        IOCON_PIO_FUNC2 |                                        /* Pin is configured as SD_POW_EN */
        IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
        IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
        IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
        IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
        IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
        IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
      );
      IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN5_IDX, port2_pin5_config); /* PORT2 PIN5 (coords: C1) is configured as SD_POW_EN */
      const uint32_t port2_pin6_config = (
        IOCON_PIO_FUNC2 |                                        /* Pin is configured as SD_D(0) */
        IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
        IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
        IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
        IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
        IOCON_PIO_SLEW_FAST |                                    /* Fast mode, slew rate control is disabled */
        IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
      );
      IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN6_IDX, port2_pin6_config); /* PORT2 PIN6 (coords: F3) is configured as SD_D(0) */
      const uint32_t port2_pin7_config = (
        IOCON_PIO_FUNC2 |                                        /* Pin is configured as SD_D(1) */
        IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
        IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
        IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
        IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
        IOCON_PIO_SLEW_FAST |                                    /* Fast mode, slew rate control is disabled */
        IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
      );
      IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN7_IDX, port2_pin7_config); /* PORT2 PIN7 (coords: J2) is configured as SD_D(1) */
      const uint32_t port2_pin8_config = (
        IOCON_PIO_FUNC2 |                                        /* Pin is configured as SD_D(2) */
        IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
        IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
        IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
        IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
        IOCON_PIO_SLEW_FAST |                                    /* Fast mode, slew rate control is disabled */
        IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
      );
      IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN8_IDX, port2_pin8_config); /* PORT2 PIN8 (coords: F4) is configured as SD_D(2) */
      const uint32_t port2_pin9_config = (
        IOCON_PIO_FUNC2 |                                        /* Pin is configured as SD_D(3) */
        IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
        IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
        IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
        IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
        IOCON_PIO_SLEW_FAST |                                    /* Fast mode, slew rate control is disabled */
        IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
      );
      IOCON_PinMuxSet(IOCON, PORT2_IDX, PIN9_IDX, port2_pin9_config); /* PORT2 PIN9 (coords: K2) is configured as SD_D(3) */
      const uint32_t port3_pin15_config = (
        IOCON_PIO_FUNC2 |                                        /* Pin is configured as SD_WR_PRT */
        IOCON_PIO_MODE_INACT |                                   /* No addition pin function */
        IOCON_PIO_INV_DI |                                       /* Input function is not inverted */
        IOCON_PIO_DIGITAL_EN |                                   /* Enables digital function */
        IOCON_PIO_INPFILT_OFF |                                  /* Input filter disabled */
        IOCON_PIO_SLEW_STANDARD |                                /* Standard mode, output slew rate control is enabled */
        IOCON_PIO_OPENDRAIN_DI                                   /* Open drain is disabled */
      );
      IOCON_PinMuxSet(IOCON, PORT3_IDX, PIN15_IDX, port3_pin15_config); /* PORT3 PIN15 (coords: D2) is configured as SD_WR_PRT */

