letssave/internship/LIS3DH/pin_mux.c
//#endif



      const uint32_t port3_pin23_config = (/* Pin is configured as FC2_CTS_SDA_SSEL0 */
                                           IOCON_PIO_FUNC1 |
                                           /* I2C mode */
                                           IOCON_PIO_I2CSLEW_I2C |
                                           /* Input function is not inverted */
                                           IOCON_PIO_INV_DI |
                                           /* Enables digital function */
                                           IOCON_PIO_DIGITAL_EN |
                                           /* Input filter disabled */
                                           IOCON_PIO_INPFILT_OFF |
                                           /* High drive: 20 mA */
                                           IOCON_PIO_I2CDRIVE_HIGH |
                                           /* I2C 50 ns glitch filter enabled */
                                           IOCON_PIO_I2CFILTER_EN);
      /* PORT3 PIN23 (coords: C2) is configured as FC2_CTS_SDA_SSEL0 */
      IOCON_PinMuxSet(IOCON, 3U, 23U, port3_pin23_config);

      const uint32_t port3_pin24_config = (/* Pin is configured as FC2_RTS_SCL_SSEL1 */
                                           IOCON_PIO_FUNC1 |
                                           /* I2C mode */
                                           IOCON_PIO_I2CSLEW_I2C |
                                           /* Input function is not inverted */
                                           IOCON_PIO_INV_DI |
                                           /* Enables digital function */
                                           IOCON_PIO_DIGITAL_EN |
                                           /* Input filter disabled */
                                           IOCON_PIO_INPFILT_OFF |
                                           /* High drive: 20 mA */
                                           IOCON_PIO_I2CDRIVE_HIGH |
                                           /* I2C 50 ns glitch filter enabled */
                                           IOCON_PIO_I2CFILTER_EN);
      /* PORT3 PIN24 (coords: E2) is configured as FC2_RTS_SCL_SSEL1 */
      IOCON_PinMuxSet(IOCON, 3U, 24U, port3_pin24_config);



      const uint32_t port0_pin10_config = (/* Pin is configured as SWO */
                                              IOCON_PIO_FUNC6 |
                                              /* No addition pin function */
                                              IOCON_PIO_MODE_INACT |
                                              /* Input function is not inverted */
                                              IOCON_PIO_INV_DI |
                                              /* Enables digital function */
                                              IOCON_PIO_DIGITAL_EN |
                                              /* Input filter disabled */
                                              IOCON_PIO_INPFILT_OFF |
                                              /* Open drain is disabled */
                                              IOCON_PIO_OPENDRAIN_DI);
         /* PORT0 PIN10 (coords: P2) is configured as SWO */
         IOCON_PinMuxSet(IOCON, 0U, 10U, port0_pin10_config);


         /* i2s */
         const uint32_t port4_pin1_config = (/* Pin is configured as FC6_SCK */
                                             IOCON_PIO_FUNC2 |
                                             /* Selects pull-up function */
                                             IOCON_PIO_MODE_PULLUP |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
         /* PORT4 PIN1 (coords: G14) is configured as FC6_SCK */
         IOCON_PinMuxSet(IOCON, 4U, 1U, port4_pin1_config);

         const uint32_t port4_pin2_config = (/* Pin is configured as FC6_RXD_SDA_MOSI_DATA */
                                             IOCON_PIO_FUNC2 |
                                             /* Selects pull-up function */
                                             IOCON_PIO_MODE_PULLUP |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
         /* PORT4 PIN2 (coords: F14) is configured as FC6_RXD_SDA_MOSI_DATA */
         IOCON_PinMuxSet(IOCON, 4U, 2U, port4_pin2_config);

         const uint32_t port4_pin3_config = (/* Pin is configured as FC6_TXD_SCL_MISO_WS */
                                             IOCON_PIO_FUNC2 |
                                             /* Selects pull-up function */
                                             IOCON_PIO_MODE_PULLUP |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Input filter disabled */
                                             IOCON_PIO_INPFILT_OFF |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
         /* PORT4 PIN3 (coords: F13) is configured as FC6_TXD_SCL_MISO_WS */
         IOCON_PinMuxSet(IOCON, 4U, 3U, port4_pin3_config);


         //accelerometer
          const uint32_t port2_pin0_config = (/* Pin is configured as FC8_RXD_SDA_MOSI */
                                                   IOCON_PIO_FUNC2 |
                                                   /* Selects pull-up function */
                                                   IOCON_PIO_MODE_PULLUP |
                                                   /* Input function is not inverted */
                                                   IOCON_PIO_INV_DI |
                                                   /* Enables digital function */
                                                   IOCON_PIO_DIGITAL_EN |
                                                   /* Input filter disabled */
                                                   IOCON_PIO_INPFILT_OFF |
                                                   /* Standard mode, output slew rate control is enabled */
                                                   IOCON_PIO_SLEW_STANDARD |
                                                   /* Open drain is enabled */
                                                   IOCON_PIO_OPENDRAIN_EN);
              /* PORT1 PIN17 (coords: N12) is configured as FC8_RXD_SDA_MOSI */
              IOCON_PinMuxSet(IOCON, 2U, 0U, port2_pin0_config);

              const uint32_t port2_pin1_config = (/* Pin is configured as FC8_TXD_SCL_MISO */
                                                   IOCON_PIO_FUNC2 |
                                                   /* Selects pull-up function */
                                                   IOCON_PIO_MODE_PULLUP |
                                                   /* Input function is not inverted */
                                                   IOCON_PIO_INV_DI |
                                                   /* Enables digital function */
                                                   IOCON_PIO_DIGITAL_EN |
                                                   /* Input filter disabled */
                                                   IOCON_PIO_INPFILT_OFF |
                                                   /* Standard mode, output slew rate control is enabled */
                                                   IOCON_PIO_SLEW_STANDARD |
                                                   /* Open drain is enabled */
                                                   IOCON_PIO_OPENDRAIN_EN);
              /* PORT1 PIN18 (coords: D1) is configured as FC8_TXD_SCL_MISO */
              IOCON_PinMuxSet(IOCON, 2U, 1U, port2_pin1_config);

              //accelerometer IRQ
              const uint32_t port1_pin18_config = (/* Pin is configured as FC8_TXD_SCL_MISO */
             		 	 	 	 	 	 	 	  0 |
                                                   /* Selects pull-up function */
 												  IOCON_PIO_MODE_INACT |
                                                   /* Input function is not inverted */
                                                   IOCON_PIO_INV_DI |
                                                   /* Enables digital function */
 												  IOCON_PIO_DIGITAL_EN |
                                                   /* Input filter disabled */
                                                   IOCON_PIO_INPFILT_OFF |
                                                   /* Standard mode, output slew rate control is enabled */
                                                   IOCON_PIO_SLEW_STANDARD |
                                                   /* Open drain is enabled */
 												  IOCON_PIO_OPENDRAIN_DI);
              /* PORT1 PIN18 (coords: D1) is configured as FC8_TXD_SCL_MISO */
              IOCON_PinMuxSet(IOCON, 1U, 18U, port1_pin18_config);

             //accelerometer IRQ 2
              const uint32_t port0_pin30_config = (/* Pin is configured as FC8_TXD_SCL_MISO */
             		 	 	 	 	 	 	 	  IOCON_PIO_FUNC2 |
                                                   /* Selects pull-up function */
 												  IOCON_PIO_MODE_INACT |
                                                   /* Input function is not inverted */
                                                   IOCON_PIO_INV_DI |
                                                   /* Enables digital function */
 												  IOCON_PIO_DIGITAL_EN |
                                                   /* Input filter disabled */
                                                   IOCON_PIO_INPFILT_OFF |
                                                   /* Standard mode, output slew rate control is enabled */
                                                   IOCON_PIO_SLEW_STANDARD |
                                                   /* Open drain is enabled */
 												  IOCON_PIO_OPENDRAIN_DI);
              /* PORT1 PIN18 (coords: D1) is configured as FC8_TXD_SCL_MISO */
             IOCON_PinMuxSet(IOCON, 0U, 30U, port0_pin30_config);


