letssave/internship/LIS3DH/pin_mux.c
             //ADC
             const uint32_t port1_pin0_config = (/* Pin is configured as FC0_TXD_SCL_MISO */
                                                  0 | /*IOCON_PIO_FUNC1 */
                                                  /* No addition pin function */
                                                  IOCON_PIO_MODE_INACT |
                                                  /* Input function is not inverted */
                                                  IOCON_PIO_INV_DI |
                                                  /* Enables digital function */
                                                  0 | /*IOCON_PIO_DIGITAL_EN */
                                                  /* Input filter disabled */
                                                  IOCON_PIO_INPFILT_OFF |
                                                  /* Standard mode, output slew rate control is enabled */
                                                  IOCON_PIO_SLEW_STANDARD |
                                                  /* Open drain is disabled */
                                                  IOCON_PIO_OPENDRAIN_DI);
             /* PORT0 PIN30 (coords: A2) is configured as FC0_TXD_SCL_MISO */
             IOCON_PinMuxSet(IOCON, 1U, 0U, port1_pin0_config);

             //PB INT
             const uint32_t port0_pin24_config = (/* Pin is configured as FC0_TXD_SCL_MISO */
                                                  0 |
                                                  /* No addition pin function */
                                                  IOCON_PIO_MODE_INACT |
                                                  /* Input function is not inverted */
                                                  IOCON_PIO_INV_DI |
                                                  /* Enables digital function */
                                                  IOCON_PIO_DIGITAL_EN |
                                                  /* Input filter disabled */
                                                  IOCON_PIO_INPFILT_OFF |
                                                  /* Standard mode, output slew rate control is enabled */
                                                  IOCON_PIO_SLEW_STANDARD |
                                                  /* Open drain is disabled */
												  IOCON_PIO_OPENDRAIN_DI);
             /* PORT0 PIN30 (coords: A2) is configured as FC0_TXD_SCL_MISO */
             IOCON_PinMuxSet(IOCON, 0U, 24U, port0_pin24_config);

             //PB Poweroff
             const uint32_t port1_pin22_config = (/* Pin is configured as FC0_TXD_SCL_MISO */
                                                  IOCON_PIO_FUNC1 |
                                                  /* No addition pin function */
                                                  IOCON_PIO_MODE_INACT |
                                                  /* Input function is not inverted */
                                                  IOCON_PIO_INV_DI |
                                                  /* Enables digital function */
                                                  IOCON_PIO_DIGITAL_EN |
                                                  /* Input filter disabled */
                                                  IOCON_PIO_INPFILT_OFF |
                                                  /* Standard mode, output slew rate control is enabled */
                                                  IOCON_PIO_SLEW_STANDARD |
                                                  /* Open drain is disabled */
												  IOCON_PIO_OPENDRAIN_EN);
             /* PORT0 PIN30 (coords: A2) is configured as FC0_TXD_SCL_MISO */
             IOCON_PinMuxSet(IOCON, 1U, 22U, port1_pin22_config);

}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
